# Data Encoding

In [ ]:
Why we need to do encoding?

In [ ]:
Suppose you have to predict salaries with experience and degree. 
for experience it is still fine but how will model will be able to understand BE vs PHD

In [ ]:
Converting Categorical feature into some meaningful numerical value is called Encoding.

In [ ]:
1. Nominal/One hot encoding (OHE) : 

Red [1,0,0]
Green [0,1,0]
Blue [0,0,1]
         Red      Green     Blue
Red      1          0         0
Green    0          1         0 
Blue     0          0         1

Disadvantage : if there are 100 categories, 100 additional features will be created increasing data size.
Model Overfitting due to sparse.

In [4]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder

In [3]:
## Create d dataFrame

df = pd.DataFrame({ 'color' : ['Red','Green','Blue','Orange','Green','Pink','Orange']})

In [4]:
df

    color
0     Red
1   Green
2    Blue
3  Orange
4   Green
5    Pink
6  Orange

In [5]:
# Create an istance of one hot encoder

In [20]:
encoder = OneHotEncoder()

In [21]:
# Perform fit and transform 
encoded = encoder.fit_transform(df[['color']]).toarray()

In [22]:
import pandas as pd
encoder_df = pd.DataFrame(encoded,columns = encoder.get_feature_names_out())

In [23]:
encoder_df

   color_Blue  color_Green  color_Orange  color_Pink  color_Red
0         0.0          0.0           0.0         0.0        1.0
1         0.0          1.0           0.0         0.0        0.0
2         1.0          0.0           0.0         0.0        0.0
3         0.0          0.0           1.0         0.0        0.0
4         0.0          1.0           0.0         0.0        0.0
5         0.0          0.0           0.0         1.0        0.0
6         0.0          0.0           1.0         0.0        0.0

In [26]:
encoder.fit_transform([['Green']]).toarray()

array([[1.]])

In [8]:
## Create d dataFrame

df2 = pd.DataFrame({ 'color' : ['Red','Green','Blue',['Orange','Green'],'Green','Pink','Orange']})

In [9]:
df2

             color
0              Red
1            Green
2             Blue
3  [Orange, Green]
4            Green
5             Pink
6           Orange

In [10]:
# Perform fit and transform 
encoder.fit_transform(df2[['color']]).toarray()

TypeError: Encoders require their input to be uniformly strings or numbers. Got ['list', 'str']

In [1]:
import seaborn as sns
df = sns.load_dataset('tips')

In [2]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
encoder = OneHotEncoder()

In [6]:
encoded = encoder.fit_transform(df[['sex','smoker','day']]).toarray()

In [7]:
df = pd.DataFrame(encoded, columns = encoder.get_feature_names_out())

In [8]:
df

,sex_Female,sex_Male,smoker_No,smoker_Yes,day_Fri,day_Sat,day_Sun,day_Thur
0,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
1,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
2,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
3,0.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0
4,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0
...,...,...,...,...,...,...,...,...
239,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0
240,1.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0
241,0.0,1.0,0.0,1.0,0.0,1.0,0.0,0.0
242,0.0,1.0,1.0,0.0,0.0,1.0,0.0,0.0
243,1.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0

# Label & Ordinal Encoding

In [ ]:
Label encoding involves assigning a unique numerical label to each category in the variable. The labels are usually assigned in 
alphabetical order or based on the frequency of the categories. 

For Example, if we have a categorical variable 'Color' with three possible values (red,green,blue),
we can represent it using label encoding as follows: 

Red : 1
Green : 2
Blue : 3

In [37]:
from sklearn.preprocessing import LabelEncoder

In [38]:
df = pd.DataFrame({'color' : ['blue','green','red']})

In [39]:
df.head()

   color
0   blue
1  green
2    red

In [40]:
lbl_encoder = LabelEncoder()

In [41]:
lbl_encoder.fit_transform(df[['color']])

C:\Users\nitesh.sethia\AppData\Local\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0, 1, 2])

In [47]:
lbl_encoder.fit_transform([['red']])

C:\Users\nitesh.sethia\AppData\Local\anaconda3\Lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([0], dtype=int64)

## Ordinal Encoding

In [ ]:
In Ordinal Ranking is provided to the data

High School 1
College 2
Graduate 3
Post Graduate 4

In [9]:
from sklearn.preprocessing import OrdinalEncoder

In [10]:
df = pd.DataFrame({ 'size' : ['small','medium','large','medium','small','large']})

In [11]:
df

     size
0   small
1  medium
2   large
3  medium
4   small
5   large

In [12]:
# Creating instance of ordinal encode and then fit_transform

In [13]:
encoder = OrdinalEncoder(categories = [['small','medium','large']])

In [14]:
encoder.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

# Target Guided Ordinal Encoding

In [ ]:
It is a technique used to encode categorial variables based on their relationship with the target variable.

In [ ]:
We replace based on the mean and median of the target value.

In [56]:
df = pd.DataFrame({ 'city' : ['New York', 'London', 'Paris','Tokyo','New York', 'Paris'],
                   'price' : [200,140,300,280,390,320]})

In [57]:
df

       city  price
0  New York    200
1    London    140
2     Paris    300
3     Tokyo    280
4  New York    390
5     Paris    320

In [60]:
mean_price = df.groupby('city')['price'].mean()

In [61]:
mean_price

city
London      140.0
New York    295.0
Paris       310.0
Tokyo       280.0
Name: price, dtype: float64

In [62]:
df['city_encoded'] = df['city'].map(mean_price)

In [63]:
df

       city  price  city_encoded
0  New York    200         295.0
1    London    140         140.0
2     Paris    300         310.0
3     Tokyo    280         280.0
4  New York    390         295.0
5     Paris    320         310.0

In [64]:
df[['price','city_encoded']]

   price  city_encoded
0    200         295.0
1    140         140.0
2    300         310.0
3    280         280.0
4    390         295.0
5    320         310.0

In [65]:
import seaborn as sns

In [66]:
sns.load_dataset('tips')

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [ ]:
# Convert time basis total bill